% use Riemann to Integration
%3-1
h = 1/10^4; %區段
E = 0;
%計算單面
for i = 0:10^4
    for j = 0:10^4
        E = E + ((9*10^9 * 1)/((-0.5+i*h)^2+(-0.5+j*h)^2 +0.25))*h*h*0.5/(((-0.5+i*h)^2+(-0.5+j*h)^2 +0.25)^0.5);
    end
end
E = 6*E;    %單面*6
fprintf('(1) The total flux is %.8f (Volt.m)\n',E);

%3-2
h = 2/10^4; %區段
E = 0;
%計算單面
for i = 0:10^4
    for j = 0:10^4
        E = E + ((9*10^9 * 1)/((-1+i*h)^2+(-1+j*h)^2 + 1))*h*h*1/(((-1+i*h)^2+(-1+j*h)^2 + 1)^0.5);
    end
end
E = 6*E;    %單面*6
fprintf('(2) The total flux is %.8f (Volt.m)\n',E);

%3-3
h = 2/10^4; %區段
E = 0;
E1 = 0;
E2 = 0;
%計算近的三面
for i = 0:10^4
    for j = 0:10^4
        E1 = E1 + ((9*10^9 * 1)/((0.4-(-1+i*h))^2+(0.4-(-1+j*h))^2 + 0.36))*h*h*0.6/(((0.4-(-1+i*h))^2+(0.4-(-1+j*h))^2 + 0.36)^0.5);
    end
end
E1 = 3*E1;
%計算遠的三面
for i = 0:10^4
    for j = 0:10^4
        E2 = E2 + ((9*10^9 * 1)/((0.4-(-1+i*h))^2+(0.4-(-1+j*h))^2 + 1.96))*h*h*1.4/(((0.4-(-1+i*h))^2+(0.4-(-1+j*h))^2 + 1.96)^0.5);
    end
end
E2 = E2*3;
E = E1+E2;
fprintf('(3) The total flux is %.8f (Volt.m)\n',E);

%3-4
h = 2/10^4; %區段
E = 0;
E1 = 0;
E2 = 0;
%計算近的三面
for i = 0:10^4-1
    for j = 0:10^4
        E1 = E1 + ((9*10^9 * 1)/((2-(-1+i*h))^2+(2-(-1+j*h))^2 + 1))*h*h*1/(((2-(-1+i*h))^2+(2-(-1+j*h))^2 + 1)^0.5);
    end
end
E1 = 3*E1;
%計算遠的三面
for i = 0:10^4-1
    for j = 0:10^4
        E2 = E2 + ((9*10^9 * 1)/((2-(-1+i*h))^2+(2-(-1+j*h))^2 + 9))*h*h*3/(((2-(-1+i*h))^2+(2-(-1+j*h))^2 + 9)^0.5);
    end
end
E2 = E2*3;
E = E1+E2;
fprintf('(4) The total flux is %.8f (Volt.m)\n',E);


